app/controllers/pages_controller.rb

  def index
    @pages = Page.paginate(:all, :page => params[:page])
---
SELECT * FROM `pages` WHERE (`pages`.wiki_id = 1)
SELECT count(*) AS count_all FROM `pages`

  def show
    @page = Page.find_by_wiki_title!(params[:id])
---
SELECT * FROM `pages` WHERE (`pages`.`wiki_title` = 'jfeiaj') LIMIT 1

  def edit
    @page = Page.find_by_wiki_title!(params[:id])
---
SELECT * FROM `pages` WHERE (`pages`.`wiki_title` = 'jfeiaj') LIMIT 1

  def create
    if logged_in?
      @page = current_user.pages.new(params[:page])
    else
      params[:page].delete(:user_id)
      @page = Page.new(params[:page])
    end

    respond_to do |format|
      if @page.save!
---
INSERT INTO `pages` (`body_html`, `updated_at`, `title`, `body`, `user_id`, `wiki_title`, `created_at`) VALUES('<p>har har har</p>', '2009-01-07 05:06:47', 'moog moog', 'har har har', 1, 'moog_moog', '2009-01-07 05:06:47')

  def update
    @page = Page.find_by_wiki_title!(params[:id])

    respond_to do |format|
      if @page.update_attributes(params[:page].merge({:user => current_user}))
---
SELECT * FROM `pages` WHERE (`pages`.`wiki_title` = 'Home') LIMIT 1
UPDATE `pages` SET `body` = 'yah rite \r\n\r\n*d00d* this is **awesome**\r\n\r\n*NO WAI*', `user_id` = 2, `body_html` = '<p>yah rite</p>\n<p><strong>d00d</strong> this is <b>awesome</b></p>\n<p><strong>NO <span class=\"caps\">WAI</span></strong></p>', `updated_at` = '2009-01-07 03:54:24' WHERE `id` = 1

  def revert
    @page = Page.find_by_wiki_title!(params[:id])
---
SELECT * FROM `pages` WHERE (`pages`.`wiki_title` = 'Home') LIMIT 1

  def revisions
    @page = Page.find_by_wiki_title(params[:id])
---
SELECT * FROM `pages` WHERE (`pages`.`wiki_title` = 'Home') LIMIT 1