app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `remember_token`, `login`, `email`, `created_at`) VALUES('', 'a19fc79a9a8f99e8c6c2508babae9797000f2fbe', '2009-01-02 06:33:39', '029d7092f8a3e18f927a218c21eabacec1364e38', NULL, NULL, 'jeremy', 'jeremy@jeremy.com', '2009-01-02 06:33:39')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save

UPDATE `users` SET `crypted_password` = '02d82ca923378047b990a0cc836ca3cb31807bf1', `updated_at` = '2009-01-08 21:10:58' WHERE `id` = 1
---
  def update
    @user = current_user

    respond_to do |format|
      if current_user.update_attributes(params[:user])